In [1]:
import numpy as np
import pandas as pd

In [3]:
ser1 = pd.Series([1,2,3,4],['a','b','c','d'])
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
ser1[0]

1

In [5]:
ser1['a']

1

In [8]:
ser2 = pd.Series(np.arange(1,5),['a','b','c','d'])
ser2

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
ser3 = pd.Series(d)
ser3

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
from numpy.random import randn

df = pd.DataFrame(randn(3,4), ['Row1', 'Row2', 'Row3'], ['Col1', 'Col2', 'Col3', 'Col4'])
df

          Col1      Col2      Col3      Col4
Row1  0.433205  0.909424  1.984212 -0.346964
Row2  0.985195  0.905326 -1.564283 -0.575443
Row3  0.341532  0.562385 -1.895464  0.734622

In [40]:
df['Col1']

Row1    0.433205
Row2    0.985195
Row3    0.341532
Name: Col1, dtype: float64

In [15]:
type(df['Col1'])

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[['Col1', 'Col2']]

          Col1      Col2
Row1  0.433205  0.909424
Row2  0.985195  0.905326
Row3  0.341532  0.562385

In [18]:
type(df[['Col1', 'Col2']])

pandas.core.frame.DataFrame

In [19]:
df['new'] = df['Col1'] + df['Col2']

In [20]:
df

          Col1      Col2      Col3      Col4       new
Row1  0.433205  0.909424  1.984212 -0.346964  1.342629
Row2  0.985195  0.905326 -1.564283 -0.575443  1.890521
Row3  0.341532  0.562385 -1.895464  0.734622  0.903918

In [24]:
df.drop('new', axis=1)

          Col1      Col2      Col3      Col4
Row1  0.433205  0.909424  1.984212 -0.346964
Row2  0.985195  0.905326 -1.564283 -0.575443
Row3  0.341532  0.562385 -1.895464  0.734622

In [25]:
df

          Col1      Col2      Col3      Col4       new
Row1  0.433205  0.909424  1.984212 -0.346964  1.342629
Row2  0.985195  0.905326 -1.564283 -0.575443  1.890521
Row3  0.341532  0.562385 -1.895464  0.734622  0.903918

In [27]:
df.loc['Row1']

Col1    0.433205
Col2    0.909424
Col3    1.984212
Col4   -0.346964
new     1.342629
Name: Row1, dtype: float64

In [28]:
type(df.loc['Row1'])

pandas.core.series.Series

In [29]:
df.iloc[0]

Col1    0.433205
Col2    0.909424
Col3    1.984212
Col4   -0.346964
new     1.342629
Name: Row1, dtype: float64

In [32]:
df.loc['Row1', 'Col1']

0.4332052382933605

In [34]:
df.iloc[0,0]

0.4332052382933605

In [35]:
df.loc[['Row1', 'Row2'], ['Col1', 'Col2']]

          Col1      Col2
Row1  0.433205  0.909424
Row2  0.985195  0.905326

In [38]:
# Unlike numpy array range, 'Stop' label is included in Dataframes. 
# Both 'start' and 'stop' labels are necessary

df.loc['Row1':'Row3', 'Col1':'Col3']

          Col1      Col2      Col3
Row1  0.433205  0.909424  1.984212
Row2  0.985195  0.905326 -1.564283
Row3  0.341532  0.562385 -1.895464

In [74]:
np.random.seed(101)

In [75]:
df = pd.DataFrame(np.random.randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df['new'] = df['W'] + df['X']

In [58]:
df.drop(columns='new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df.loc[:,['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [66]:
type(df.loc[['A', 'B'],['W', 'X']])

pandas.core.frame.DataFrame

In [76]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df['Z']<0

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [78]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [80]:
df.loc[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [82]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [83]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)

In [84]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [103]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
df.groupby('Company').describe().transpose()['FB']['Sales']['count']